Tekla Open API Reference for Tekla Structures 2025
ClashCheckOptions Properties
The ClashCheckOptions type exposes the following members.
Properties
Name | Description
BoltHeadDiameter
The bolt head diameter.
NutThickness
The nut thickness.
Top
See Also
Reference
ClashCheckOptions Class
Tekla.Structures Namespace